Repository: pingfangx/TranslatorX-other
Catalog: GitDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The fourth syntax ("git merge --continue") can only be run after the merge has resulted in conflicts.
zh_cn: 第四个语法("git merge --continue")只能在冲突合并有结果后运行。

source: The full SHA-1 object name (40-byte hexadecimal string), or a leading substring that is unique within the repository.
zh_cn: 完整的 SHA-1对象名称(40字节十六进制字符串)或仓库中唯一的前导子字符串。

source: The index
zh_cn: 索引

source: The index and working tree are also left unchanged as a result.
zh_cn: 因此，索引和工作树也保持不变。

source: The index file is initialized with a list of all paths and, for each path, a blob object and a set of attributes.
zh_cn: index 文件使用所有路径的列表进行初始化，对于每个路径，都使用 blob 对象和一组属性。

source: The index is also capable of storing multiple entries (called "stages") for a given pathname.
zh_cn: 该 index 还能够存储给定路径名的多个条目(称为"stages")。

source: The index is updated after successful completion, but the change must still be committed.
zh_cn: 索引在成功完成后更新，但仍必须提交更改。

source: The index may be updated with new content, and new commits may be created from the content stored in the index.
zh_cn: index 可以用新内容更新，并且新提交可以从存储在 index 中的内容创建。

source: The index may contain unmerged entries because of a previous failed merge.
zh_cn: 索引可能包含未合并的条目，因为以前的合并失败。

source: The intent of this option is to pick and choose lines of the patch to apply, or even to modify the contents of lines to be staged.
zh_cn: 此选项的目的是选择并选择要应用的补丁行，或者甚至修改要暂存的行的内容。

source: The interface (input, output, set of options and the semantics) to these low-level commands are meant to be a lot more stable than Porcelain level commands, because these commands are primarily for scripted use.
zh_cn: 这些低级命令的接口(输入，输出，选项集和语义)意味着比高级命令更稳定，因为这些命令主要用于脚本使用。

source: The interface to Porcelain commands on the other hand are subject to change in order to improve the end user experience.
zh_cn: 另一方面，高级指令的接口可能会发生更改，以改善最终用户体验。

source: The internals are documented in the Git API documentation.
zh_cn: 内部文档记录在 Git API 文档中。

source: The last three commits (HEAD, HEAD^, and HEAD~2) were bad and you do not want to ever see them again.
zh_cn: 最后三个提交 (HEAD, HEAD^, 和 HEAD~2) 都不好，你不想再看到它们了。

source: The latest stash you created is stored in refs/stash; older stashes are found in the reflog of this reference and can be named using the usual reflog syntax (e.g. stash@{0} is the most recently created stash, stash@{1} is the one before it, stash@{2.hours.ago} is also possible).
zh_cn: 您创建的最新的储藏存储在 refs/stash 中;在这个引用的 reflog 中可以找到较旧的储藏，并且可以使用通常的 reflog 语法来命名(例如 stash@{0} 是最近创建的储藏，stash@{1} 是之前的一个， stash@{2.hours.ago} 也是可能的)。

source: The list below describes some common things you may see in a patch, and which editing operations make sense on them.
zh_cn: 下面的列表介绍了您可能在补丁中看到的一些常见问题，哪些编辑操作对它们有意义。

source: The list of mailbox files to read patches from.
zh_cn: 从中读取补丁的邮箱文件列表。

source: The main command loop has 6 subcommands (plus help and quit).
zh_cn: 主命令循环有6个子命令(加上帮助和退出)。

source: The main command loop has 6 subcommands.
zh_cn: 主命令循环有6个子命令。

source: The meaning of a signoff depends on the project, but it typically certifies that committer has the rights to submit this work under the same license and agrees to a Developer Certificate of Origin (see http://developercertificate.org/ for more information).
zh_cn: 签收的含义取决于项目，但通常证明提交者有权以相同的许可证提交此作品，并同意开发者原产地证书(见 http://developercertificate.org/ 更多信息)。

source: The merge mechanism (git merge and git pull commands) allows the backend merge strategies to be chosen with -s option.
zh_cn: 合并机制( git merge 和 git pull 命令)允许使用 -s 选项后的 merge strategies 。

source: The message taken from file with -F, command line with -m, and from commit object with -C are usually used as the commit log message unmodified.
zh_cn: 从 -F ，带有 -m 的命令行和带有 -C 的提交对象的文件中的消息通常用作提交日志消息未修改。

source: The mode parameter is optional (defaults to all), and is used to specify the handling of untracked files; when -u is not used, the default is normal, i.e. show untracked files and directories.
zh_cn: mode 参数是可选的(默认为 all )，用于指定未跟踪文件的处理;当不使用 -u 时，默认值为 normal ，即显示未跟踪的文件和目录。

source: The modifications stashed away by this command can be listed with git stash list, inspected with git stash show, and restored (potentially on top of a different commit) with git stash apply.
zh_cn: 可以使用 git stash list 列出此命令储藏的修改，使用 git stash show 进行检查，并使用 git stash apply 还原（可能在不同的提交之上）。

source: The name is actually the section and the key separated by a dot, and the value will be escaped.
zh_cn: 名称实际上是由点分隔的 section 和 key，值将被转义。

source: The name is set to the path where the submodule has been added unless it was customized with the --name option of git submodule add.
zh_cn: 该名称设置为添加子模块的路径，除非使用 git submodule add 的 --name 选项进行自定义。

source: The name of a commit at which to start the new branch; see git-branch[1] for details.
zh_cn: 启动新分支的提交的名称;详见 git-branch[1] 。

source: The name of a new directory to clone into.
zh_cn: 要克隆到的新目录的名称。

source: The name of an existing branch to rename.
zh_cn: 要重命名的现有分支的名称。

source: The name of one of the following can be used instead of a URL as <repository> argument:
zh_cn: 可以使用以下名称之一替代 URL 作为 <repository> 参数：

source: The name of the branch to create or delete.
zh_cn: 要创建或删除的分支的名称。

source: The name of the object to show.
zh_cn: 要显示的对象的名称。

source: The name of the tag to create, delete, or describe.
zh_cn: 要创建，删除或描述的标签的名称。

source: The names of objects to show.
zh_cn: 要显示的对象的名称。

source: The names of refs that are fetched, together with the object names they point at, are written to .git/FETCH_HEAD.
zh_cn: 被抓取的引用名称与它们所指向的对象名称一起写入 .git/FETCH_HEAD 。

source: The native transport (i.e. git:// URL) does no authentication and should be used with caution on unsecured networks.
zh_cn: 本地传输(即 git:// URL)不进行身份验证，在不安全的网络上应谨慎使用。

source: The new branch head will point to this commit.
zh_cn: 新的分支机头将指向该提交。

source: The new branch name must pass all checks defined by git-check-ref-format[1].
zh_cn: 新的分支名称必须通过由 git-check-ref-format[1] 定义的所有检查。

source: The new commit has the same parents and author as the current one (the --reset-author option can countermand this).
zh_cn: 新提交与目前的提交有相同的父和作者( --reset-author 选项可以取消这个)。

source: The new name for an existing branch.
zh_cn: 现有分支的新名称。

source: The new tag name must pass all checks defined by git-check-ref-format[1].
zh_cn: 新的标签名称必须通过由 git-check-ref-format[1] 定义的所有检查。

source: The next fetch or pull will create them again unless you configure them not to.
zh_cn: 下一个 fetch 或 pull 将重新创建它们，除非您将它们配置为不。

source: The object database contains objects of three main types: blobs, which hold file data; trees, which point to blobs and other trees to build up directory hierarchies; and commits, which each reference a single tree and some number of parent commits.
zh_cn: 对象数据库包含三种主要类型的对象：保存文件数据的 blob ; 指向 blob 和其他树来建立目录层次结构的树（tree）; 以及引用单个树和一些父提交的提交（commit）。

source: The object that the new tag will refer to, usually a commit.
zh_cn: 新标签将引用的对象，通常是提交。

source: The ones listed near the end of this list name trees and blobs contained in a commit.
zh_cn: 列于列表末尾附近的那些名称包含在提交中的树和 Blob。

source: The optional default parameter is used instead, if there is no color configured for name.
zh_cn: 如果没有为 name ，则使用可选的 default 参数。

source: The optional colon that terminates the "magic signature" can be omitted if the pattern begins with a character that does not belong to "magic signature" symbol set and is not a colon.
zh_cn: 如果模式以不属于 "魔术签名" 符号集并且不是冒号的字符开始，则可以省略终止 "魔术签名" 的可选冒号。

source: The optional configuration variable core.excludesFile indicates a path to a file containing patterns of file names to exclude from git-add, similar to $GIT_DIR/info/exclude.
zh_cn: 可选配置变量 core.excludesFile 表示包含要从 git-add 中排除的文件名模式的文件的路径，类似于 $GIT_DIR/info/exclude 。

source: The options --contains, --no-contains, --merged and --no-merged serve four related but different purposes:
zh_cn: --contains ， --no-contains ， --merged 和 --no-merged 四个相关但不同的目的：

source: The other file, git-add{litdd}interactive.perl, has 403 lines added and 35 lines deleted if you commit what is in the index, but working tree file has further modifications (one addition and one deletion).
zh_cn: 另一个文件，git-add{litdd}interactive.perl，如果提交了索引，则添加了403行，删除了35行，但是工作树文件进一步修改(一次添加和一次删除)。

source: The output format can be overridden using the optional <format> argument.
zh_cn: 可以使用可选的 <format> 参数覆盖输出格式。

source: The output of this command is convenient for e-mail submission or for use with git am.
zh_cn: 此命令的输出可方便电子邮件提交或与 git am 一起使用。

source: The parser accepts a space instead of the T character as well.
zh_cn: 解析器也接受一个空格而不是 T 字符。

source: The path name must not end with a /.
zh_cn: 路径名称不能以 / 结尾。

source: The pathspec syntax is as follows:
zh_cn: pathspec 语法如下：

source: The pattern is a shell wildcard (i.e., matched using fnmatch(3)).
zh_cn: 该模式是一个 shell 通配符（即使用 fnmatch(3) 进行匹配）。

source: The placeholders are:
zh_cn: 占位符是：

source: The possible options are:
zh_cn: 可能的选择是：

source: The primary reason for rerunning git init is to pick up newly added templates (or to move the repository to another place if --separate-git-dir is given).
zh_cn: 重新运行 git init 的主要原因是拾取新添加的模板(或者如果给出了--separate-git-dir，则将仓库移动到另一个位置)。

source: The purpose of gitignore files is to ensure that certain files not tracked by Git remain untracked.
zh_cn: gitignore 文件的目的是确保 Git 未跟踪的某些文件保持不跟踪。

source: The recorded tree is prepared as usual (including the effect of the -i and -o options and explicit pathspec), and the message from the original commit is used as the starting point, instead of an empty message, when no other message is specified from the command line via options such as -m, -F, -c, etc.
zh_cn: 记录的树按照常规进行准备(包括 -i 和 -o 选项和显式 pathspec 的效果)，并将来自原始提交的消息用作开始点，而不是空消息，当没有通过诸如 -m ， -F ，-c等选项从命令行指定其他消息等时。

source: The reflog covers all recent actions, and in addition the HEAD reflog records branch switching.
zh_cn: reflog 涵盖了所有最近的动作，另外 HEAD reflog 记录分支切换。

source: The request, printed to the standard output, begins with the branch description, summarizes the changes and indicates from where they can be pulled.
zh_cn: 打印到标准输出的该请求以分支描述开始，总结了更改并指出可以从哪里拉出。

source: The resulting repository starts out without any object of its own.
zh_cn: 生成的仓库开始没有任何自己的对象。

source: The resulting working tree file will appear to re-add the content.
zh_cn: 生成的工作树文件将显示为重新添加内容。

source: The revert only modifies the working tree and the index.
zh_cn: 恢复只修改工作树和索引。

source: The same restrictions as for <branchname> apply.
zh_cn: 适用与 <branchname> 相同的限制。

source: The scope of that pathspec is limited to that subtree.
zh_cn: 该 pathspec 的范围仅限于该子树。

source: The second .gitignore prevents Git from ignoring arch/foo/kernel/vmlinux.lds.S.
zh_cn: 第二个.gitignore 会阻止 Git 忽略 arch/foo/kernel/vmlinux.lds.S 。

source: The second syntax ("git merge --abort") can only be run after the merge has resulted in conflicts.
zh_cn: 第二个语法("git merge --abort")只能在合并导致冲突后运行。

source: The section or key is invalid (ret=1),
zh_cn: section 或键无效(ret = 1)，

source: The standard email format as described by RFC 2822, for example Thu, 07 Apr 2005 22:13:13 +0200.
zh_cn: RFC 2822描述的标准电子邮件格式，例如 Thu, 07 Apr 2005 22:13:13 +0200 。

source: The standard helper program to use with git-merge-index
zh_cn: 与 git-merge-index 一起使用的标准助手程序

source: The syntax is fairly flexible and permissive; whitespaces are mostly ignored.
zh_cn: 语法是相当灵活和宽容的;空白大多被忽略。

source: The tables below show what happens when running:
zh_cn: 下表显示运行时会发生什么：

source: The text up to the first blank line in a commit message is treated as the commit title, and that title is used throughout Git.
zh_cn: 直到提交消息中的第一个空白行的文本被视为提交标题，并且该标题在整个 Git 中使用。

source: The total number of paths.
zh_cn: 路径总数。

source: The tree of actual checked out files.
zh_cn: 实际检出文件的树。

source: The type is required unless -t or -p is used to find the object type, or -s is used to find the object size, or --textconv or --filters is used (which imply type "blob").
zh_cn: type 是必需的，除非 -t 或 -p 用于查找对象类型，或者 -s 用于查找对象大小，或 --textconv 或 --filters (这意味着类型为 "blob")。

source: The type specifier can be either --int or --bool, to make git config ensure that the variable(s) are of the given type and convert the value to the canonical form (simple decimal number for int, a "true" or "false" string for bool), or --path, which does some path expansion (see --path below).
zh_cn: 类型说明符可以是 --int 或 --bool ，以使 git config 确保变量是给定的类型并将该值转换为规范形式（简单十进制数为 int，“true”或“false”字符串为bool）或 --path ，表示一些路径扩展（参见下面的 --path）。

source: The underlying Git plumbing tools, such as git ls-files and git read-tree, read gitignore patterns specified by command-line options, or from files specified by command-line options.
zh_cn: 底层的 Git 管道工具，例如 git ls-files 和 git read-tree ，读取命令行选项指定的 gitignore 模式，或从命令行选项指定的文件读取。

source: The value for a variable that takes a color is a list of colors (at most two, one for foreground and one for background) and attributes (as many as you want), separated by spaces.
zh_cn: 获取颜色的变量的值是颜色列表(最多两个，一个用于前台，另一个用于背景)和属性(尽可能多的)，以空格分隔。

source: The value for many variables that specify various sizes can be suffixed with k, M,…​ to mean "scale the number by 1024", "by 1024x1024", etc.
zh_cn: 指定各种大小的许多变量的值，可以后缀为 k ， M ，...表示“将数字缩放1024”，“1024×1024”等等。

source: The value given will override values from configuration files.
zh_cn: 给定的值将覆盖配置文件中的值。

source: The variable names are case-insensitive, allow only alphanumeric characters and -, and must start with an alphabetic character.
zh_cn: 变量名称不区分大小写，仅允许字母数字字符和 - ，并且必须以字母字符开头。

source: The variables are divided into sections, wherein the fully qualified variable name of the variable itself is the last dot-separated segment and the section name is everything before the last dot.
zh_cn: 变量分为几个部分，其中变量本身的完全限定变量名称是最后一个点分隔的段，段名称是最后一个点之前的所有内容。

source: The web browser can be specified using the configuration variable help.browser, or web.browser if the former is not set.
zh_cn: 该 Web 浏览器可以使用配置的变量 help.browser 指定，如果前者未设置，也可以使用 web.browser 指定。

source: The working directory must match the index.
zh_cn: 工作目录必须与索引匹配。

source: The working tree files will include a description of the conflict bracketed by the usual conflict markers <<<<<<< and >>>>>>>.
zh_cn: 工作树文件将包括由通常的冲突标记 <<<<<<< 和 >>>>>>> 括起来的冲突说明。

source: The working tree normally contains the contents of the HEAD commit’s tree, plus any local changes that you have made but not yet committed.
zh_cn: 工作树通常包含 HEAD 提交树的内容，以及您所做但尚未提交的任何本地更改。

source: The “--” is necessary to avoid confusion with the branch named gitk
zh_cn: “--”是必要的，以避免与名为 gitk 的 branch 混淆

source: Then "git merge topic" will replay the changes made on the topic branch since it diverged from master (i.e., E) until its current commit (C) on top of master, and record the result in a new commit along with the names of the two parent commits and a log message from the user describing the changes.
zh_cn: "git merge topic"将在master 之上重播 topic 分支上所做的更改，从它与 master 分离(即 E )，直到它的当前提交( C )，并将结果记录在一个新的提交中，有两个父提交的名称和一个用户描述更改的日志消息。

source: Then git bisect picks a commit between those two endpoints and asks you whether the selected commit is "good" or "bad".
zh_cn: 然后 git bisect 在这两个端点之间选择一个提交，并询问所选提交是“good”还是“bad”。

source: There are also more complex operations that can be performed.
zh_cn: 还可以执行更复杂的操作。

source: There are also several operations which should be avoided entirely, as they will make the patch impossible to apply:
zh_cn: 还有几个操作应该完全避免，因为它们会使补丁变得不可行：

source: There are several built-in formats, and you can define additional formats by setting a pretty.<name> config option to either another format name, or a format: string, as described below (see git-config[1]).
zh_cn: 有几种内置格式，您可以通过 pretty.<name> 配置选项设置为另一种格式名称或 format: 字符串来定义其他格式，如下所述(参见 git-config[1])。

source: There is no option for git rm to remove from the index only the paths that have disappeared from the filesystem.
zh_cn: git rm 没有选项可以从索引中移除已从文件系统中消失的路径。

source: Therefore:
zh_cn: 因此：

source: These are internal helper commands used by other commands; end users typically do not use them directly.
zh_cn: 这些是其他命令使用的内部帮助命令；终端用户通常不直接使用它们。

source: These are safe to remove once a file has been merged and its git mergetool session has completed.
zh_cn: 一旦文件合并且其 git mergetool 会话已完成，这些可以安全地移除。

source: These commands are to interact with foreign SCM and with other people via patch over e-mail.
zh_cn: 这些命令是通过电子邮件补丁与外部 SCM 和其他人进行交互。

source: These environment variables apply to all core Git commands.
zh_cn: 这些环境变量适用于全部核心 Git 命令。

source: These options are mostly targeted for packing of Git repositories.
zh_cn: 这些选项主要用于打包 Git 存储库。

source: These patterns match relative to the location of the .gitignore file.
zh_cn: 相对于 .gitignore 文件的位置相匹配的模式。

source: These stages are used to hold the various unmerged version of a file when a merge is in progress.
zh_cn: 这些 stages 用于在合并进行时保存文件的各种未合并版本。

source: This open sourced site is hosted on GitHub.
zh_cn: 该 开源 网站 在 GitHub 拖管。

source: This adds, modifies, and removes index entries to match the working tree.
zh_cn: 这将添加，修改和删除索引条目以匹配工作树。

source: This allows for secure parsing of the output without getting confused e.g. by values that contain line breaks.
zh_cn: 这允许输出包含换行符的值时安全解析，而不会变得混淆。

source: This allows removing all untracked files, including build products.
zh_cn: 这允许删除所有未跟踪的文件，包括构建产品。

source: This also renews the author timestamp.
zh_cn: 这也更新了作者的时间戳。

source: This behavior may be changed via the global branch.autoSetupMerge configuration flag.
zh_cn: 此行为可能会通过全局 branch.autoSetupMerge 配置标志来更改。

source: This can also be controlled by setting the GIT_DIR environment variable.
zh_cn: 这也可以通过设置 GIT_DIR 环境变量来控制。

source: This can also be controlled by setting the GIT_EXEC_PATH environment variable.
zh_cn: 这也可以通过设置 GIT_EXEC_PATH 环境变量来控制。

source: This can also be controlled by setting the GIT_WORK_TREE environment variable and the core.worktree configuration variable (see core.worktree in git-config[1] for a more detailed discussion).
zh_cn: 这也可以通过设置 GIT_WORK_TREE 环境变量和 core.worktree 配置变量来控制(参见 git-config[1] 中的 core.worktree 进行更详细的讨论)。

source: This can also be controlled by the --work-tree command-line option and the core.worktree configuration variable.
zh_cn: 这也可以由 --work-tree 命令行选项和 core.worktree 配置变量控制。

source: This can be quicker and more flexible than using the interactive hunk selector.
zh_cn: 这可以比使用交互式 hunk 选择器更快更灵活。

source: This can be used (possibly in conjunction with git reset) to create a pristine working directory to test a clean build.
zh_cn: 这可以用来(可能与 git reset 一起使用)创建一个原始的工作目录来测试一个干净的构建。

source: This can be used to split a commit into two:
zh_cn: 这可以用来将提交分为两个：

source: This can be used when you want to include further changes to the merge, or want to write your own merge commit message.
zh_cn: 当您想要对合并进行进一步更改时，或者想要自己编写合并提交消息，可以使用此选项。

source: This can help with debugging object negotiation or other protocol issues.
zh_cn: 这可以帮助调试对象协商或其他协议问题。

source: This can, for example, be useful to remove all build products.
zh_cn: 例如，这可以用于移除所有构建产品。

source: This command applies the patch but does not create a commit.
zh_cn: 此命令应用补丁，但不创建提交。

source: This command can be performed multiple times before a commit.
zh_cn: 该命令可以在提交之前多次执行。

source: This command can run commit-msg, prepare-commit-msg, pre-commit, post-commit and post-rewrite hooks.
zh_cn: 该命令可以运行 commit-msg ， prepare-commit-msg ， pre-commit ， post-commit 和 post-rewrite 钩子。

source: This command creates an empty Git repository - basically a .git directory with subdirectories for objects, refs/heads, refs/tags, and template files.
zh_cn: 此命令创建一个空的 Git 仓库 - 基本上是一个 .git 目录，其目录包含 objects ， refs/heads ，refs/tags 和模板文件。

source: This command generates such auxiliary files.
zh_cn: 此命令生成这样的辅助文件。

source: This command is used by git pull to incorporate changes from another repository and can be used by hand to merge changes from one branch into another.
zh_cn: 该命令由 git pull 用于包含来自另一个仓库的更改，可以手动使用将一个分支的更改合并到另一个分支。

source: This command manages the information recorded in the reflogs.
zh_cn: 该命令管理在 reflog 中记录的信息。

source: This command provides support for git fetch and git pull to operate by packaging objects and references in an archive at the originating machine, then importing those into another repository using git fetch and git pull after moving the archive by some means (e.g., by sneakernet).
zh_cn: 该命令提供对 git fetch 和 git pull 的支持，通过在原始机器上打包对象和引用到一个存档中，然后通过某种方式移动存档后（如通过 sneakernet），使用 git fetch 和 git pull 导入到另一个仓库。

source: This command updates the index using the current content found in the working tree, to prepare the content staged for the next commit.
zh_cn: 此命令使用工作树中找到的当前内容更新索引，以为下一次提交准备暂存的内容。

source: This command uses a binary search algorithm to find which commit in your project’s history introduced a bug.
zh_cn: 该命令使用二分查找算法来查找项目历史记录中提交的错误。

source: This command will fail with non-zero status upon error.
zh_cn: 该命令将以非零的错误状态码失败。

source: This counts the number of unpacked object files and disk space consumed by them, to help you decide when it is a good time to repack.
zh_cn: 这将计算未打包对象文件的数量和它们消耗的磁盘空间，以帮助您决定什么时候重新打包。

source: This default behavior can be changed by using the --tags or --no-tags options or by configuring remote.<name>.tagOpt.
zh_cn: 可以使用--tags 或--no-tags 选项或配置 remote.<name>.tagOpt 来更改此默认行为。

source: This default configuration is achieved by creating references to the remote branch heads under refs/remotes/origin and by initializing remote.origin.url and remote.origin.fetch configuration variables.
zh_cn: 默认配置的实现通过在 refs/remotes/origin 下创建对远程分支头的引用，并通过初始化 remote.origin.url 和 remote.origin.fetch 配置变量。

source: This diff will not be a part of the commit message.
zh_cn: 此差异不会是提交消息的一部分。

source: This document attempts to write down and motivate some of the workflow elements used for git.git itself.
zh_cn: 本文档尝试写下并激励用于 git.git 本身的某些工作流元素。

source: This effectively runs add --interactive, but bypasses the initial command menu and directly jumps to the patch subcommand.
zh_cn: 这有效地运行 add --interactive ，但绕过初始命令菜单，直接跳转到 patch 子命令。

source: This environment allows the specification of an alternate index file.
zh_cn: 此环境变量允许指定备用索引文件。

source: This environment variable allows the specification of an index version for new repositories.
zh_cn: 该环境变量允许为新的仓库指定索引版本。

source: This environment variable can be set to true to tell Git not to stop at filesystem boundaries.
zh_cn: 该环境变量可以设置为 true，以告知 Git 不要在文件系统边界停止。

source: This environment variable can be used along with $HOME and $XDG_CONFIG_HOME to create a predictable environment for a picky script, or you can set it temporarily to avoid using a buggy /etc/gitconfig file while waiting for someone with sufficient permissions to fix it.
zh_cn: 这个环境变量可以与 $HOME 和 $XDG_CONFIG_HOME 一起使用，为挑选脚本创建一个可预测的环境，也可以临时设置，以避免使用错误的 /etc/gitconfig 。

source: This environment variable overrides $EDITOR and $VISUAL.
zh_cn: 此环境变量覆盖 $EDITOR 和 $VISUAL 。

source: This environment variable overrides $PAGER.
zh_cn: 此环境变量覆盖 $PAGER 。

source: This file contains the commit message of a commit in progress.
zh_cn: 此文件包含正在进行的提交的提交消息。

source: This flag disables these checks, and can cause the remote repository to lose commits; use it with care.
zh_cn: 此标志禁用这些检查，并可能导致远程仓库丢失提交;小心使用它。

source: This flag forces progress status even if the standard error stream is not directed to a terminal.
zh_cn: 即使标准错误流未指向终端，该标志也强制进行状态。

source: This form is convenient to push the current branch without thinking about its local name.
zh_cn: 这种形式方便地推送当前的分支，而不考虑其本地名称。

source: This form is only needed to create a new branch or tag in the remote repository when the local name and the remote name are different; otherwise, the ref name on its own will work.
zh_cn: 此形式仅用于，当本地名称和远程名称不同时，在远程仓库中创建新的分支或标签;否则，自己的引用名称将工作。

source: This form is to compare the given two paths on the filesystem.
zh_cn: 该形式是比较文件系统上给定的两个路径。

source: This form is to view the changes on the branch containing and up to the second <commit>, starting at a common ancestor of both <commit>.
zh_cn: 此形式是查看包含并直到第二个<commit> 的分支上的更改，从 <commit> 的共同祖先开始。
